def f(x):
    x = x**2 + 3
    return x
c = 0
for i in range(10, 31, 2):
    c += f(i)
print(c)
'''Найдите сумму всех значений функции y(x) = x2 + 3 на интервале от 10 до 30 с шагом 2.'''