Пятница = {10: 250, 16: 350, 20: 450}
Чемпионы = {10: 250, 13: 350, 16: 350}
Пернатая = {10: 350, 14: 350, 18: 450}
a = input('Выберите фильм: ').title()
b = input('Выберите день: ').title()
if b == 'Сегодня':
	b = 1
else:
	b = 0.95
c = int(input('Выберите время: '))
d = int(input('Выберите количество билетов: '))
if d >= 20:
	d = d * 0.8 
if a == 'Пятница':
	cost = Пятница[c] * b * d
elif a == 'Чемпионы':
	cost = Чемпионы[c] * b * d
else:
	cost = Пернатая[c] * b * d
print('Цена билета составит: ' + str(cost) + ' рублей')